app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs"
---
  def index
    if params[:artist_id]
      find_song
      @artist = @songs.artists
    else
      @songs = Song.all

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
---
  def find_song
    @song = Artist.find_by_id(params[:artist_id])